{
  "header": {
    "home": "Início",
    "about": "Sobre",
    "skills": "Habilidades",
    "projects": "Projetos",
    "contact": "Contato"
  },
  "HomePage": {
    "introduction": "Olá, sou Matheus Link",
    "stack": "Desenvolvedor Front-End",
    "modalBtn": "Sobre Mim",
    "modalContent": "Tenho 19 anos, curso Ciências da Computação e estudo programação desde 2023, onde comecei a estudar lógica e algoritmos utilizando o VisualG e aprendendo com o saudoso professor Gustavo Guanabara. Sempre curti o mundo da tecnologia mas nunca soube pra onde ir, até que um primo já consolidado na área me indicou a programação, e desde então venho me esforçando cada dia mais para me tornar um Desenvolvedor e acima de tudo uma pessoa de sucesso!🚀 ",
    "modalClose": "Fechar"
  },
  "Skills": "Aqui você pode ver as tecnologias com as quais me sinto confortável utilizando no meu dia a dia. Estou sempre buscando evoluir e ampliar meu conjunto de habilidades, além de estar 100% disposto a aprender novas tecnologias.",
  "Projects": {
    "ProjectsLabel": "Aqui você pode ver alguns de meus projetos desenvolvidos durante essa jornada.",
    "projectLanguage": "Idioma do Projeto:",
    "F1Roster": "Site onde o usuário pode consultar informações sobre a atual temporada da Fórmula 1, como: Calendário, classificação do campeonato de pilotos, resultados e os pilotos da temporada. Nesse projeto foi desafiador converter os dados XML que retornavam de uma API para JSON, e também foi desafiador lidar com vários tipos de dados, formatar horários com base no local do dispositivo e deixar a página responsiva e acessível.",
    "Polyngo": "Site fictício de uma instituição de ensino. Feito com React, Node e Express. Nele o usuário pode consultar idiomas ensinados, formações, além de operações de cadastro e login. Foi desafiador lidar com as operações necessárias, com a consulta de dados, validação de dados de cadastro e login, estou enfrentando problemas com as políticas do CORS nessa aplicação, então você pode enfrentar problemas.",
    "EcoMatters": "Site fictício de uma organização ambiental, feito em React, Vite e utilizando ContextApi. Nele o usuário pode adicionar produtos da loja ao carrinho, também é feita a soma de todos os produtos adicionados e o valor total é exibido e alterado conforme o que o usuário adiciona ao carrinho. Foi um dos meus primeiros projetos utilizando React JS, abordando tópicos que até então eu nunca tinha utilizado de forma prática e sem a ajuda de um tutorial. Certamente foi um projeto que me ajudou à compreender aluns tópicos fundamentais do React JS.",
    "MovieVerse": "Site de filmes desenvolvido com React JS, com funcionalidades básicas como pesquisa e adição e remoção de filmes à lista de favoritos. Desenvolvi esse projeto para praticar conceitos básicos do React JS, como o consumo de APIs, uso da Context API e de navegação utilizando a biblioteca react-router-dom. Existem algumas funcionalidades que posso implementar em breve, mas por enquanto é só isso.",
    "ChatBase": "Projeto de Chat, desenvolvido com React JS, Firebase e Zustand. Nele os usuários podem usufruir das funcionalidads básicas de uma aplicação de Chat, como: Enviar mensagens, enviar imagens, adicionar conversas e bloquear usuários. Esse projeto foi feito a partir de um tutorial, foi desafiador compreender todas as funcionalidades do firebase necessárias para esse projeto, como autenticação, criação de chats e envio de mensagens e imagens. Certamente esse projeto me ajudou a compreender uma tecnologia que busco me aprofundar.",
    "CuriCoffee": "Aplicativo de cafeterias de Curitiba, sendo desenvolvido em React Native, Expo e mapbox. Nesssa aplicação o usuário poderá encontrar cafeterias, ver detalhes e traçar rotas. É meu primeiro projeto com React Native, eu tinha começado um projeto parecido utilizando React JS, porém não avancei, a idéia desse projeto veio em meio à minha vontade de aprender sobre Desenvolvimento Mobile e a necessidade para trabalhar em um aplicativo.",
    "GameLinker": "Site de informações de jogos, construído com React JS e TypeScript, utilizando a API Rawg, que fornece informações detalhadas dos jogos. No site, os usuários podem ver os jogos mais vendidos, filtrar por gênero, pesquisar jogos e consultar detalhes. Implementar filtros, ordenação, carrosséis e paginação foi desafiador, mas essencial para melhorar desempenho e experiência do usuário. Este projeto me ensinou muito sobre essas funcionalidades",
    "ModalBtn": "Detalhes"
  },
  "Form": {
    "nameLabel": "Seu Nome:",
    "msgLabel": "Sua Mensagem:",
    "errorMsg": "Preencha esse campo !",
    "textAreaPlaceholder": "Ví seu portfólio e gostaria de lhe fornecer um feedback...",
    "buttonLabel": "Enviar Mensagem"
  },
  "Contact": "Entre em contato comigo por um dos meios listados abaixo ou me envie um email de forma rápida pelo formulário ! Sua mensagem será muito importante para mim."
}
